package java03_oop;
/*	
 * 一个源文件中只能有一个public类，且源文件的名称跟public类名一样；可以有多个非public类
 * -----------------------------------------------------------------------------------------------------------------------------------------
 * 	如何在cmd里面编译带包的文件?
 * 		javac -d c:\myclass Demo.java	-d后面指定目录，如果是点就表示当前目录；
 * 		因为Deom.java里有指定package mypack.haha.hehe;所以javac编译后会在c:\myclass里自动创建包名mypacka一样的文件夹；
 * 	要运行的话，得先去包的目录才能找到class文件；
 *  	set classpath=.;c:\myclass;(没有eclipse，在cmd中这么来)
 *  ------------------------------------------------------------------------------------------------------------------------------
 *  包权限
 * 		加上public修饰类才能被其他的包访问；他里面的方法也需要public；
 *  	要访问其他包中的类，一定要使用包名；
 *  	构造方法的权限是跟着类走的，public；
 *  
 *  四种权限
 *  		 public	protected default private
 *  不同包中		ok		-		-		-
 *  子类			ok		ok		-		-
 *  同一包中		ok		ok		ok		-
 *  同一类中		ok		ok		ok		ok	
 *  
 *  包与包之间只有两种，public protected(这还是个特例)
 *  private   类里面的才能访问
 *  default   同一个包的其他类能访问
 *  protected 同一个包的其他类能访问,子类也可以访问
 *  public    同一个包的其他类能访问,子类也可以访问,不同的包也可以访问
 * -------------------------------------------------------------------------------------------------------------------------------------------- 
 * */			 

class G02_权限 {
	public static void main(String[] args) {
		System.out.println("packdemo run");
	}
}
/*------------------------------------------------------------------------------------------------------------------------------*/
