package java01_base;

/* -----------------------------------------------------------------------------------------------------------------------------------------
 * 常量			
 *		程序中固定不会变的量；	整数、小数；
 * 
 * 五种常用类型：
 * 		浮点型（小数）、
 * 		布尔型（true和false）、
 * 		字符型（单引号表示'a'）、
 * 		字符串型（双引号"string"）、
 * 		空常量（null）;
 * 	例子；"a"+1--a1;		"5+5="+(5+5)--5+5=10	'a'+1=98(ASCII码)
 * 
 * 转义字符
 * 		\r			回车
 *		\n			换行
 *		\r\n		Windows里面表示回车换行
 *		\t			tab缩进
 *		\"			引号输出
 *		\\			反斜杠输出
 */

public class C1_常量 {
	private final String FILEEXT = ".pdf";			//默认的文件名;		final修饰的变量只能被赋值一次，相当于是常量
	final double PI = 3.1415927;
	
	public static void main(String[] args) {	
		
	}
}
